app/views/rentals/_form.html.haml

      %h2
        = t('errors_prohibited', count: @rental.errors.count, model: t('activerecord.models.rental'))
---
SELECT  `rentals`.* FROM `rentals` WHERE `rentals`.`id` = 1 LIMIT 1