app/controllers/rentals_controller.rb

  def create
    box = Box.find(params[:box_id])
    @rental = box.create_active_rental(rental_params)
---
SELECT `boxes`.* FROM `boxes` WHERE (`boxes`.`id` NOT IN (8, 1))
INSERT INTO `rentals` (`serial`, `box_id`, `customer_name`, `customer_identifier`, `days`, `is_active`, `payed`, `created_at`, `updated_at`) VALUES ('Ho81UWJFdg', 8, 'Misu', '432009RA', 3, 1, 30, '2017-02-04 13:10:05', '2017-02-04 13:10:05')

  def update
    if @rental.update(rental_params)
---
UPDATE `rentals` SET `customer_name` = 'Misu Mester', `payed` = 20, `updated_at` = '2017-02-04 13:37:30' WHERE `rentals`.`id` = 1

  def end
    @rental.update(fine: params[:fine], is_active: false)
---
UPDATE `rentals` SET `is_active` = 0, `payed` = 130, `updated_at` = '2017-02-05 08:01:26' WHERE `rentals`.`id` = 7

  def total
    @rentals = Rental.all
---
SELECT `rentals`.* FROM `rentals`

  def search
    @rentals = Rental.active.search(params[:serial])
---
SELECT `rentals`.* FROM `rentals`

    def find_rental
      @rental = Rental.find(params[:id])
---
SELECT  `rentals`.* FROM `rentals` WHERE `rentals`.`id` = 7 LIMIT 1